Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.59/PIC32CM-JH01/include/pio/pic32cm2532jh01032.h
/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA02B_PTC_DS0                          _UL_(2)     
#define MUX_PA02B_PTC_DS0                          _UL_(1)     
#define PINMUX_PA02B_PTC_DS0                       ((PIN_PA02B_PTC_DS0 << 16) | MUX_PA02B_PTC_DS0)
#define PORT_PA02B_PTC_DS0                         (_UL_(1) << 2)

#define PIN_PA03B_PTC_DS1                          _UL_(3)     
#define MUX_PA03B_PTC_DS1                          _UL_(1)     
#define PINMUX_PA03B_PTC_DS1                       ((PIN_PA03B_PTC_DS1 << 16) | MUX_PA03B_PTC_DS1)
#define PORT_PA03B_PTC_DS1                         (_UL_(1) << 3)

#define PIN_PA04B_PTC_DS2                          _UL_(4)     
#define MUX_PA04B_PTC_DS2                          _UL_(1)     
#define PINMUX_PA04B_PTC_DS2                       ((PIN_PA04B_PTC_DS2 << 16) | MUX_PA04B_PTC_DS2)
#define PORT_PA04B_PTC_DS2                         (_UL_(1) << 4)

#define PIN_PA05B_PTC_DS3                          _UL_(5)     
#define MUX_PA05B_PTC_DS3                          _UL_(1)     
#define PINMUX_PA05B_PTC_DS3                       ((PIN_PA05B_PTC_DS3 << 16) | MUX_PA05B_PTC_DS3)
#define PORT_PA05B_PTC_DS3                         (_UL_(1) << 5)

#define PIN_PA06B_PTC_DS4                          _UL_(6)     
#define MUX_PA06B_PTC_DS4                          _UL_(1)     
#define PINMUX_PA06B_PTC_DS4                       ((PIN_PA06B_PTC_DS4 << 16) | MUX_PA06B_PTC_DS4)
#define PORT_PA06B_PTC_DS4                         (_UL_(1) << 6)

#define PIN_PA07B_PTC_DS5                          _UL_(7)     
#define MUX_PA07B_PTC_DS5                          _UL_(1)     
#define PINMUX_PA07B_PTC_DS5                       ((PIN_PA07B_PTC_DS5 << 16) | MUX_PA07B_PTC_DS5)
#define PORT_PA07B_PTC_DS5                         (_UL_(1) << 7)

#define PIN_PA08B_PTC_DS16                         _UL_(8)     
#define MUX_PA08B_PTC_DS16                         _UL_(1)     
#define PINMUX_PA08B_PTC_DS16                      ((PIN_PA08B_PTC_DS16 << 16) | MUX_PA08B_PTC_DS16)
#define PORT_PA08B_PTC_DS16                        (_UL_(1) << 8)

#define PIN_PA09B_PTC_DS17                         _UL_(9)     
#define MUX_PA09B_PTC_DS17                         _UL_(1)     
#define PINMUX_PA09B_PTC_DS17                      ((PIN_PA09B_PTC_DS17 << 16) | MUX_PA09B_PTC_DS17)
#define PORT_PA09B_PTC_DS17                        (_UL_(1) << 9)

#define PIN_PA10B_PTC_DS18                         _UL_(10)    
#define MUX_PA10B_PTC_DS18                         _UL_(1)     
#define PINMUX_PA10B_PTC_DS18                      ((PIN_PA10B_PTC_DS18 << 16) | MUX_PA10B_PTC_DS18)
#define PORT_PA10B_PTC_DS18                        (_UL_(1) << 10)

#define PIN_PA11B_PTC_DS19                         _UL_(11)    
#define MUX_PA11B_PTC_DS19                         _UL_(1)     
#define PINMUX_PA11B_PTC_DS19                      ((PIN_PA11B_PTC_DS19 << 16) | MUX_PA11B_PTC_DS19)
#define PORT_PA11B_PTC_DS19                        (_UL_(1) << 11)

#define PIN_PA16B_PTC_DS20                         _UL_(16)    
#define MUX_PA16B_PTC_DS20                         _UL_(1)     
#define PINMUX_PA16B_PTC_DS20                      ((PIN_PA16B_PTC_DS20 << 16) | MUX_PA16B_PTC_DS20)
#define PORT_PA16B_PTC_DS20                        (_UL_(1) << 16)

#define PIN_PA17B_PTC_DS21                         _UL_(17)    
#define MUX_PA17B_PTC_DS21                         _UL_(1)     
#define PINMUX_PA17B_PTC_DS21                      ((PIN_PA17B_PTC_DS21 << 16) | MUX_PA17B_PTC_DS21)
#define PORT_PA17B_PTC_DS21                        (_UL_(1) << 17)

#define PIN_PA18B_PTC_DS22                         _UL_(18)    
#define MUX_PA18B_PTC_DS22                         _UL_(1)     
#define PINMUX_PA18B_PTC_DS22                      ((PIN_PA18B_PTC_DS22 << 16) | MUX_PA18B_PTC_DS22)
#define PORT_PA18B_PTC_DS22                        (_UL_(1) << 18)

#define PIN_PA19B_PTC_DS23                         _UL_(19)    
#define MUX_PA19B_PTC_DS23                         _UL_(1)     
#define PINMUX_PA19B_PTC_DS23                      ((PIN_PA19B_PTC_DS23 << 16) | MUX_PA19B_PTC_DS23)
#define PORT_PA19B_PTC_DS23                        (_UL_(1) << 19)

#define PIN_PA22B_PTC_DS26                         _UL_(22)    
#define MUX_PA22B_PTC_DS26                         _UL_(1)     
#define PINMUX_PA22B_PTC_DS26                      ((PIN_PA22B_PTC_DS26 << 16) | MUX_PA22B_PTC_DS26)
#define PORT_PA22B_PTC_DS26                        (_UL_(1) << 22)

#define PIN_PA23B_PTC_DS27                         _UL_(23)    
#define MUX_PA23B_PTC_DS27                         _UL_(1)     
#define PINMUX_PA23B_PTC_DS27                      ((PIN_PA23B_PTC_DS27 << 16) | MUX_PA23B_PTC_DS27)
#define PORT_PA23B_PTC_DS27                        (_UL_(1) << 23)

#define PIN_PA08B_PTC_X0                           _UL_(8)     
#define MUX_PA08B_PTC_X0                           _UL_(1)     
#define PINMUX_PA08B_PTC_X0                        ((PIN_PA08B_PTC_X0 << 16) | MUX_PA08B_PTC_X0)
#define PORT_PA08B_PTC_X0                          (_UL_(1) << 8)

#define PIN_PA09B_PTC_X1                           _UL_(9)     
#define MUX_PA09B_PTC_X1                           _UL_(1)     
#define PINMUX_PA09B_PTC_X1                        ((PIN_PA09B_PTC_X1 << 16) | MUX_PA09B_PTC_X1)
#define PORT_PA09B_PTC_X1                          (_UL_(1) << 9)

#define PIN_PA10B_PTC_X2                           _UL_(10)    
#define MUX_PA10B_PTC_X2                           _UL_(1)     
#define PINMUX_PA10B_PTC_X2                        ((PIN_PA10B_PTC_X2 << 16) | MUX_PA10B_PTC_X2)
#define PORT_PA10B_PTC_X2                          (_UL_(1) << 10)

#define PIN_PA11B_PTC_X3                           _UL_(11)    
#define MUX_PA11B_PTC_X3                           _UL_(1)     
#define PINMUX_PA11B_PTC_X3                        ((PIN_PA11B_PTC_X3 << 16) | MUX_PA11B_PTC_X3)
#define PORT_PA11B_PTC_X3                          (_UL_(1) << 11)

#define PIN_PA16B_PTC_X4                           _UL_(16)    
#define MUX_PA16B_PTC_X4                           _UL_(1)     
#define PINMUX_PA16B_PTC_X4                        ((PIN_PA16B_PTC_X4 << 16) | MUX_PA16B_PTC_X4)
#define PORT_PA16B_PTC_X4                          (_UL_(1) << 16)

#define PIN_PA17B_PTC_X5                           _UL_(17)    
#define MUX_PA17B_PTC_X5                           _UL_(1)     
#define PINMUX_PA17B_PTC_X5                        ((PIN_PA17B_PTC_X5 << 16) | MUX_PA17B_PTC_X5)
#define PORT_PA17B_PTC_X5                          (_UL_(1) << 17)

#define PIN_PA18B_PTC_X6                           _UL_(18)    
#define MUX_PA18B_PTC_X6                           _UL_(1)     
#define PINMUX_PA18B_PTC_X6                        ((PIN_PA18B_PTC_X6 << 16) | MUX_PA18B_PTC_X6)
#define PORT_PA18B_PTC_X6                          (_UL_(1) << 18)

#define PIN_PA19B_PTC_X7                           _UL_(19)    
#define MUX_PA19B_PTC_X7                           _UL_(1)     
#define PINMUX_PA19B_PTC_X7                        ((PIN_PA19B_PTC_X7 << 16) | MUX_PA19B_PTC_X7)
#define PORT_PA19B_PTC_X7                          (_UL_(1) << 19)

